---
kind: type
id: T:Autodesk.Revit.DB.WallSide
source: html/91c4f3e9-d268-dfcb-fed4-fcee840ceb3a.htm
---
# Autodesk.Revit.DB.WallSide

Represents the possible sides of a wall where a sweep or reveal may be attached.

## Syntax (C#)
```csharp
public enum WallSide
```